app/Controllers/RhController.php

SELECT *
FROM `conges`
WHERE `conges`.`id` = '2'
---
public function approuverConge($id)
{
    $congeModel = new CongeModel();
    $soldeModel = new SoldeModel();

    $rhId  = session()->get('employe_id');
    $conge = $congeModel->find($id);