app/Models/CongeModel.php

SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `type_conge`.`libelle` AS `type_libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id`   = `conges`.`employe_id`
JOIN `type_conge` ON `type_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `conges`.`created_at` ASC
---
    public function getEnAttente()
    {
        return $this->select('conges.*,
                    employes.nom, employes.prenom,
                    type_conge.libelle AS type_libelle')
                    ->join('employes',   'employes.id   = conges.employe_id')
                    ->join('type_conge', 'type_conge.id = conges.type_conge_id')
                    ->where('conges.statut', 'en_attente')
                    ->orderBy('conges.created_at', 'ASC')
                    ->findAll();