app/Models/EmployeModel.php

    public function findByEmail(string $email)
    {
        return $this->where('email', $email)->where('actif', 1)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'marie.rabe@rh.com'
AND `actif` = 1
 LIMIT 1