app/Models/SoldeModel.php

    public function getSolde(int $employeId, int $typeCongeId, int $annee)
    {
        return $this->where('employe_id',    $employeId)
                    ->where('type_conge_id', $typeCongeId)
                    ->where('annee',         $annee)
                    ->first();
---
SELECT *
FROM `soldes`
WHERE `employe_id` = 4
AND `type_conge_id` = 2
AND `annee` = 2026
 LIMIT 1